[Killed] BlockStatement
dev_web_service_with_ts_and_nodejs/my_first_suite_test_project/src/Queue.ts:4:45
 export class Queue<T> {
     private _store: T[] = [];
 
-    constructor(initialData: Array<T> = []) {
-        this._store.push(...initialData)
-    }
+    constructor(initialData: Array<T> = []) {}
 
     push(val: T) {
killedBy: Queue Should be able to initialized with an initializer
statusReason: expected +0 to equal 5

[Killed] ArrayDeclaration
dev_web_service_with_ts_and_nodejs/my_first_suite_test_project/src/Queue.ts:4:41
 export class Queue<T> {
     private _store: T[] = [];
 
-    constructor(initialData: Array<T> = []) {
+    constructor(initialData: Array<T> = ["Stryker was here"]) {
         this._store.push(...initialData)
     }
killedBy: Queue Should be able to initialized without an initializer
statusReason: expected 1 to equal +0

[Killed] BlockStatement
dev_web_service_with_ts_and_nodejs/my_first_suite_test_project/src/Queue.ts:12:26
         this._store.push(val);
     }
 
-    pop(): T | undefined {
-        return this._store.shift();
-    }
+    pop(): T | undefined {}
 
     isEmpty(): boolean {
killedBy: Queue Should be able to add a new element after initialized
statusReason: expected undefined to equal 1

[Killed] BlockStatement
dev_web_service_with_ts_and_nodejs/my_first_suite_test_project/src/Queue.ts:16:24
         return this._store.shift();
     }
 
-    isEmpty(): boolean {
-        // return this._store.length === 0;
-        // return this.size() === 0;
-        return true;
-    }
+    isEmpty(): boolean {}
 
     size(): number {
killedBy: Queue Should check if the queue is empty when there is no data there
statusReason: expected undefined to equal true

[Killed] BooleanLiteral
dev_web_service_with_ts_and_nodejs/my_first_suite_test_project/src/Queue.ts:19:16
     isEmpty(): boolean {
         // return this._store.length === 0;
         // return this.size() === 0;
-        return true;
+        return false;
     }
 
killedBy: Queue Should check if the queue is empty when there is no data there
statusReason: expected false to equal true

[Killed] BlockStatement
dev_web_service_with_ts_and_nodejs/my_first_suite_test_project/src/Queue.ts:22:20
         return true;
     }
 
-    size(): number {
-        return this._store.length;
-    }
+    size(): number {}
 }
killedBy: Queue Should be able to initialized without an initializer
statusReason: expected undefined to equal +0
